Revit 2024 API
AdvancedWood.WoodRingThickness Property
 The property labeled "Thickness (cm) of yearly growth ring" from the "AdvancedWood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string WoodRingThickness { get; }
Visual Basic
Public Shared ReadOnly Property WoodRingThickness As String
	Get
Visual C++
public:
static property String^ WoodRingThickness {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDistance".
See Also
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace